Tekla.Structures.Model.BoltGroup.BoltTypeEnum
The type of the bolt.

Tekla.Structures.Model.BoltGroup.BoltTypeEnum.BOLT_TYPE_SITE
The site bolt type.

Tekla.Structures.Model.BoltGroup.BoltTypeEnum.BOLT_TYPE_WORKSHOP
The workshop bolt type.